cases/3D_cavity/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel Newtonian;

// Laminar viscosity
nu              1.2e-02;

// Thermal expansion coefficient
beta            0.0;//3.8e-04;

// Reference temperature
TRef            300;

// Laminar Prandtl number
Pr              300.0;

// Turbulent Prandtl number
Prt             310.0;

// Fluid density

rho		1420.0;		// density (EFH3 TDS)
// ************************************************************************* //
