cases/3D_cavity/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.01;

vertices
(
    (0 0 0)
    (3 0 0)
    (3 30 0)
    (0 30 0)
    (0 0 20)
    (3 0 20)
    (3 30 20)
    (0 30 20)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 80 80) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    bottomWall
    {
        type wall;
        faces
        (
	    (1 5 4 0)
        );
    }

    topWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }


    leftWall
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }

    rightWall
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }

    frontAndBack
    {
        type wall;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
